artillery-learning/test.yml
config:
  target: "http://httpbin.org/"

  # Load Test(1800 seconds = 30 minutes)
  phases:
    - duration: 1800
      arrivalRate: 2
      name: Load Test

  # Stress Test(600 seconds = 10 minutes)
  #  phases:
  #  - duration: 600
  #    arrivalRate: 6
  #    name: Stress Test

  # Scalability Test(300 seconds = 5 minutes)
  #  phases:
  #    - duration: 300
  #      arrivalRate: 1
  #      name: Scalability 1
  #    - duration: 300
  #      arrivalRate: 2
  #      name: Scalability 2
  #    - duration: 300
  #      arrivalRate: 3
  #      name: Scalability 3
  #    - duration: 300
  #      arrivalRate: 4
  #      name: Scalability 4
  #    - duration: 300
  #      arrivalRate: 5
  #      name: Scalability 5

  # Spike Test(300 seconds = 5 minutes)
  #phases:
  #  - duration: 300
  #    arrivalRate: 2
  #    name: Spike-pre Warm-Up
  #  - duration: 10
  #    arrivalRate: 20
  #    name: Spike test
  #  - duration: 300
  #    arrivalRate: 2
  #    name: Spike-post Cool-down

  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 1000
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 3000"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            username: "Test User"
            password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"

      # - log: "Json value from response is: {{request_body}}"
      # - log: "Host value from response is: {{host}}"